# CantCopyFrom3dTo2dFam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CantCopyFrom3dTo2dFam Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't copy 3D element(s) into a 2D family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantCopyFrom3dTo2dFam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantCopyFrom3dTo2dFam As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantCopyFrom3dTo2dFam {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace